AccumulationRegisters/НДСПредъявленный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>НДСПредъявленный</Name>
			<Comment> НДС, предъявляемый поставщиком</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияНДСПредъявленный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентнаяОперация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СчетФактура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦенности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенностей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДеятельностиНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсправленныйСчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеализацияЭкспорт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/НДСПредъявленный/Ext/RecordSetModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения") ИЛИ ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Таблица.Период                  КАК Период,
	|	Таблица.Организация             КАК Организация,
	|	Таблица.СчетФактура             КАК СчетФактура,
	|	Таблица.Поставщик               КАК Поставщик,
	|	Таблица.ВидЦенности             КАК ВидЦенности,
	|	Таблица.СтавкаНДС               КАК СтавкаНДС,
	|	Таблица.ВидДеятельностиНДС      КАК ВидДеятельностиНДС,
	|	Таблица.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
	|	Таблица.РеализацияЭкспорт       КАК РеализацияЭкспорт,
	|	Таблица.Событие                 КАК Событие,
	|	Таблица.КорВидДеятельностиНДС   КАК КорВидДеятельностиНДС,
	|	Таблица.ИдентификаторСтроки     КАК ИдентификаторСтроки,
	|	Таблица.РегламентнаяОперация    КАК РегламентнаяОперация,
	|	Таблица.Подразделение           КАК Подразделение,
	|	Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Таблица.СтатьяРасходов          КАК СтатьяРасходов,
	|	Таблица.АналитикаРасходов       КАК АналитикаРасходов,
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Таблица.СуммаБезНДС
	|		ИНАЧЕ -Таблица.СуммаБезНДС
	|	КОНЕЦ КАК СуммаБезНДСПередЗаписью,
	|	ВЫБОР
	|		КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Таблица.НДС
	|		ИНАЧЕ -Таблица.НДС
	|	КОНЕЦ КАК НДСПередЗаписью
	|ПОМЕСТИТЬ НДСПредъявленныйПередЗаписью
	|ИЗ
	|	РегистрНакопления.НДСПредъявленный КАК Таблица
	|ГДЕ
	|	Таблица.Регистратор = &Регистратор
	|";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения") ИЛИ ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Период                  КАК Период,
	|	ТаблицаИзменений.Организация             КАК Организация,
	|	ТаблицаИзменений.СчетФактура             КАК СчетФактура,
	|	ТаблицаИзменений.Поставщик               КАК Поставщик,
	|	ТаблицаИзменений.ВидЦенности             КАК ВидЦенности,
	|	ТаблицаИзменений.СтавкаНДС               КАК СтавкаНДС,
	|	ТаблицаИзменений.ВидДеятельностиНДС      КАК ВидДеятельностиНДС,
	|	ТаблицаИзменений.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
	|	ТаблицаИзменений.РеализацияЭкспорт       КАК РеализацияЭкспорт,
	|	ТаблицаИзменений.Событие                 КАК Событие,
	|	ТаблицаИзменений.КорВидДеятельностиНДС   КАК КорВидДеятельностиНДС,
	|	ТаблицаИзменений.ИдентификаторСтроки     КАК ИдентификаторСтроки,
	|	ТаблицаИзменений.РегламентнаяОперация    КАК РегламентнаяОперация,
	|	ТаблицаИзменений.Подразделение           КАК Подразделение,
	|	ТаблицаИзменений.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаИзменений.СтатьяРасходов          КАК СтатьяРасходов,
	|	ТаблицаИзменений.АналитикаРасходов       КАК АналитикаРасходов,
	|	СУММА(ТаблицаИзменений.СуммаБезНДСИзменение) КАК СуммаБезНДСИзменение,
	|	СУММА(ТаблицаИзменений.НДСИзменение)         КАК НДСИзменение
	|ПОМЕСТИТЬ НДСПредъявленныйИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Период                  КАК Период,
	|		Таблица.Организация             КАК Организация,
	|		Таблица.СчетФактура             КАК СчетФактура,
	|		Таблица.Поставщик               КАК Поставщик,
	|		Таблица.ВидЦенности             КАК ВидЦенности,
	|		Таблица.СтавкаНДС               КАК СтавкаНДС,
	|		Таблица.ВидДеятельностиНДС      КАК ВидДеятельностиНДС,
	|		Таблица.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
	|		Таблица.РеализацияЭкспорт       КАК РеализацияЭкспорт,
	|		Таблица.Событие                 КАК Событие,
	|		Таблица.КорВидДеятельностиНДС   КАК КорВидДеятельностиНДС,
	|		Таблица.ИдентификаторСтроки     КАК ИдентификаторСтроки,
	|		Таблица.РегламентнаяОперация    КАК РегламентнаяОперация,
	|		Таблица.Подразделение           КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.СтатьяРасходов          КАК СтатьяРасходов,
	|		Таблица.АналитикаРасходов       КАК АналитикаРасходов,
	|		Таблица.СуммаБезНДСПередЗаписью КАК СуммаБезНДСИзменение,
	|		Таблица.НДСПередЗаписью         КАК НДСИзменение
	|	ИЗ
	|		НДСПредъявленныйПередЗаписью КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.Период                  КАК Период,
	|		Таблица.Организация             КАК Организация,
	|		Таблица.СчетФактура             КАК СчетФактура,
	|		Таблица.Поставщик               КАК Поставщик,
	|		Таблица.ВидЦенности             КАК ВидЦенности,
	|		Таблица.СтавкаНДС               КАК СтавкаНДС,
	|		Таблица.ВидДеятельностиНДС      КАК ВидДеятельностиНДС,
	|		Таблица.ИсправленныйСчетФактура КАК ИсправленныйСчетФактура,
	|		Таблица.РеализацияЭкспорт       КАК РеализацияЭкспорт,
	|		Таблица.Событие                 КАК Событие,
	|		Таблица.КорВидДеятельностиНДС   КАК КорВидДеятельностиНДС,
	|		Таблица.ИдентификаторСтроки     КАК ИдентификаторСтроки,
	|		Таблица.РегламентнаяОперация    КАК РегламентнаяОперация,
	|		Таблица.Подразделение           КАК Подразделение,
	|		Таблица.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		Таблица.СтатьяРасходов          КАК СтатьяРасходов,
	|		Таблица.АналитикаРасходов       КАК АналитикаРасходов,
	|		ВЫБОР
	|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -Таблица.СуммаБезНДС
	|			ИНАЧЕ Таблица.СуммаБезНДС
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -Таблица.НДС
	|			ИНАЧЕ Таблица.НДС
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.НДСПредъявленный КАК Таблица
	|	ГДЕ
	|		Таблица.Регистратор = &Регистратор) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.Период,
	|	ТаблицаИзменений.Организация,
	|	ТаблицаИзменений.СчетФактура,
	|	ТаблицаИзменений.Поставщик,
	|	ТаблицаИзменений.ВидЦенности,
	|	ТаблицаИзменений.СтавкаНДС,
	|	ТаблицаИзменений.ВидДеятельностиНДС,
	|	ТаблицаИзменений.ИсправленныйСчетФактура,
	|	ТаблицаИзменений.РеализацияЭкспорт,
	|	ТаблицаИзменений.Событие,
	|	ТаблицаИзменений.КорВидДеятельностиНДС,
	|	ТаблицаИзменений.ИдентификаторСтроки,
	|	ТаблицаИзменений.РегламентнаяОперация,
	|	ТаблицаИзменений.Подразделение,
	|	ТаблицаИзменений.НаправлениеДеятельности,
	|	ТаблицаИзменений.СтатьяРасходов,
	|	ТаблицаИзменений.АналитикаРасходов
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ТаблицаИзменений.СуммаБезНДСИзменение) <> 0 ИЛИ СУММА(ТаблицаИзменений.НДСИзменение) <> 0) 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(ТаблицаИзменений.Период, МЕСЯЦ) КАК Месяц,
	|	ТаблицаИзменений.Организация КАК Организация,
	|	ТаблицаИзменений.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ НДСПредъявленныйЗадания
	|ИЗ
	|	НДСПредъявленныйИзменение КАК ТаблицаИзменений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НДСПредъявленныйИзменение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НДСПредъявленныйПередЗаписью";
	
	Выборка = Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
